let str = "";
for(let i = 20; i <=30; i += 0.5) {
    str += i + " ";
}

alert(`Числа від 20 до 30 з кроком 0,5 через пропуск\n${str}`);

let arr = [];
for(i = 10; i <= 100; i += 10) {
    arr.push(i + "$ = " + (i*27) + "грн");
}

console.log(arr);

arr = [];

let value = +prompt("Введіть ціле число");

for(i = 1; i <= 100; i++){
    if(i**2 <= value){
        arr.push(i);
    }
}

alert(`Цілі числа від 1 до 100, квадрат яких не перевищує числа ${value}.\n${arr}`);

value = +prompt("Введіть число, щоб дізнтись чи воно просте");

arr = [];
for(i = 1; i <= value; i++){
    if(value % i == 0){
        arr.push(i);
    }
}

if(arr.length === 2){
    alert(`Число є простим, його дільники ${arr}`);
}
else{
    alert(`Число НЕ є простим, його дільники ${arr}`);
}

value = +prompt("Введіть число, щоб дізнатись чи можна його отримати шляхом зведення числа 3 у ступінь");

while(value % 3 == 0){
    value /= 3;
}

alert(value === 1 ? "Число можливо отримати" : "Число НЕможливо отримати");